---
kind: other
id: Methods.T:Autodesk.Revit.DB.ComponentRepeater
source: html/be587555-f125-ac1a-ef87-ce9a2da2c1e2.htm
---
# ComponentRepeater Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.